package add

// max int  9223372036854775807
// 111111111111111111111111111111111111111111111111111111111111111
// نه کوینتریلیون و دویست و بیست و سه کادریلیون و سیصد و هفتاد و دو تریلیون و سی و شش میلیارد و هشتصد و پنجاه و چهار میلیون و هفتصد و هفتاد و شش هزار و هشتصد و هشت

const (
	and      string = " و "
	minus           = "منفی "
	zero            = 0
	thousand        = 1000
	hundred         = 100
)

var (
	smallNumbers = []string{
		"صفر", "یک", "دو", "سه", "چهار",
		"پنج", "شش", "هفت", "هشت", "نه",
		"ده", "یازده", "دوازده", "سیزده", "چهارده",
		"پانزده", "شانزده", "هفده", "هجده", "نوزده",}
	tensNumbers = []string{
		"", "", "بیست", "سی", "چهل", "پنجاه",
		"شصت", "هفتاد", "هشتاد", "نود",}

	hundredNumber = []string{
		"", "صد", "دویست", "سیصد", "چهارصد", "پانصد", "ششصد", "هفتصد", "هشتصد", "نهصد",
	}
	bigNumbers = []string{
		"", "هزار", "میلیون", "میلیارد", "تریلیون", "کادریلیون", "کوینتریلیون", "سکستریلیون", "سپتریلیون", "اکتریلیون", "نونیلیون", "دسیلیون", "گوگول",
	}
)
